---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.#ctor(Autodesk.Revit.DB.ElementId,System.Int32)
source: html/77e5e0c9-3302-3dd3-25f9-a80d4a428413.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.#ctor Method

Creates a valid segment id on the network.

## Syntax (C#)
```csharp
public MEPNetworkSegmentId(
	ElementId idElem,
	int segment
)
```

## Parameters
- **idElem** (`Autodesk.Revit.DB.ElementId`)
- **segment** (`System.Int32`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null